CSI API ETABS v1

# eSlabType Enumeration

---

The possible slab types.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public enum eSlabType

    Public Enumeration eSlabType

    Dim instance As eSlabType

    public enum class eSlabType

    type eSlabType

Members

| Member name| Value| Description
---|---|---|---
| Slab| 0|
| Drop| 1|
| Stiff_DO_NOT_USE| 2|
| Ribbed| 3|
| Waffle| 4|
| Mat| 5|
| Footing| 6|

Remarks

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com